README.org
#+TITLE: ODE README
#+AUTHOR: Tim Krones
#+OPTIONS: ':t H:5
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[left=2.5cm,right=2.5cm,top=2.8cm,bottom=3cm]{geometry}
#+LATEX_HEADER: \setlength{\parindent}{0cm}
#+LATEX_HEADER: \setlength{\parskip}{0.1cm}
#+LATEX_HEADER: \usepackage{pmboxdraw}
#+LATEX_HEADER: \DeclareUnicodeCharacter{00A0}{~}
#+LATEX_HEADER: \DeclareUnicodeCharacter{251C}{\pmboxdrawuni{251C}}
#+LATEX_HEADER: \renewcommand{\arraystretch}{1.2}

* About
  ODE (Output DEsigner) is a system for rapid development of
  large-scale rule bases for template-based natural language
  generation for conversational agents.

  It was developed in the context of [[http://www.aliz-e.org/][ALIZ-E]], a [[http://www.dfki.de/lt/project.php?id=Project_576&l=en][project]] that was
  carried out jointly by the German Research Center for Artificial
  Intelligence ([[http://www.dfki.de/][DFKI]]) and a number of European partners.

* Setting up
** Dependencies
   ODE requires:

   - *Java SDK 7* (Oracle JDK 7 or OpenJDK 7).
     It has not been tested with Java 8, although newer versions of
     play! (the MVC framework on which ODE is built) [[https://github.com/playframework/playframework/issues/1220][seem to be Java 8-ready]].
   - *play-2.2.1*
   - *neo4j-community-2.1.2* (bundled with this distribution of ODE).
   - *Twitter Bootstrap v3.0.2* ([[https://en.wikipedia.org/wiki/Minification_(programming)][minified]] version bundled with this
     distribution of ODE).
   - *jQuery v1.11.0* (minified version bundled with this distribution
     of ODE).
   - *jQuery UI v1.10.4* (minified version bundled with this
     distribution of ODE).
   - *Underscore.js v1.5.2* (minified version bundled with this
     distribution of ODE).
   - *Backbone.js v1.1.0* (minified version bundled with this
     distribution of ODE).

   |-------------------+-----------+----------------+------------------|
   | *Dependency*      | *Version* | *Bundled*      | *Setup required* |
   |-------------------+-----------+----------------+------------------|
   | Java SDK          |         7 | no             | yes              |
   | play!             |     2.2.1 | no             | yes              |
   | Neo4j             |     2.1.2 | yes            | yes              |
   | Twitter Bootstrap |     3.0.2 | yes (minified) | no               |
   | jQuery            |    1.11.0 | yes (minified) | no               |
   | jQuery UI         |    1.10.4 | yes (minified) | no               |
   | Underscore.js     |     1.5.2 | yes (minified) | no               |
   | Backbone.js       |     1.1.0 | yes (minified) | no               |
   |-------------------+-----------+----------------+------------------|

** Initial setup
   :PROPERTIES:
   :CUSTOM_ID: setup-initial
   :END:
   Follow these steps to prepare your environment for working on ODE:

   1. Install *Java SDK 7*.

   2. If you haven't done so already, clone the ODE repository from
      GitHub:

      #+BEGIN_SRC sh
      git clone https://github.com/itsjeyd/ODE
      #+END_SRC

   3. Extract [[file:deps/neo4j-community-2.1.2-unix.tar.gz]].

   4. Load initial data:

      #+BEGIN_SRC sh
      cd /path/to/neo4j-community-2.1.2/
      bin/neo4j-shell -path data/graph.db/ -file /path/to/this/repo/initial-data.cql
      #+END_SRC

      The output of the second command should look like this:

      #+BEGIN_EXAMPLE
      +-----------------------------------------------------+
      | n                                                   |
      +-----------------------------------------------------+
      | Node[0]{username:"dev@ode.com",password:"password"} |
      +-----------------------------------------------------+
      1 row
      Nodes created: 1
      Properties set: 2
      Labels added: 1
      1880 ms

      +--------------------------------+
      | n                              |
      +--------------------------------+
      | Node[1]{name:"underspecified"} |
      +--------------------------------+
      1 row
      Nodes created: 1
      Properties set: 1
      Labels added: 1
      36 ms
      #+END_EXAMPLE

   5. Download play! (Version 2.2.1) from [[http://downloads.typesafe.com/play/2.2.1/play-2.2.1.zip][here]] and extract it. Make
      sure you choose a location to which you have both read and write
      access.

   6. Make sure that the =play= script is executable:

      #+BEGIN_SRC sh
      cd /path/to/play-2.2.1/
      chmod a+x play
      chmod a+x framework/build
      #+END_SRC

   7. Add directory of =play= executable to your =PATH=:

      #+BEGIN_SRC sh
      export PATH=$PATH:/path/to/play-2.2.1/
      #+END_SRC

      Add this code to your =.bashrc=, =.zshrc=, etc. to make the
      modification permanent.

** Daily workflow
*** Before
    1. Start Neo4j:

       #+BEGIN_SRC sh
       cd /path/to/neo4j-community-2.1.2/
       bin/neo4j start-no-wait
       #+END_SRC

    2. Start play!:

       #+BEGIN_SRC sh
       cd /path/to/this/repo/ode/
       play
       #+END_SRC

    3. Run application (from =play= console):

       #+BEGIN_SRC sh
       run
       #+END_SRC

    4. Access application by navigating to [[http://localhost:9000/]] in
       your browser.

       When you do this for the first time you will also need to perform
       the following steps:

       a. Click the "Login" button in the top-right corner

       b. Enter credentials:
          - Email: =dev@ode.com=
          - Password: =password=

       As you make changes to the code, refreshing the current page in
       the browser will cause =play= to recompile the project.
       Note that compilation will only be triggered after changes to
       (server-side) code that actually /needs/ to be compiled.
       Modifying client-side code will not trigger compilation.

*** After
    1. Stop application (from =play= console): =Ctrl-D=

    2. Stop Neo4j:

       #+BEGIN_SRC sh
       cd /path/to/neo4j-community-2.1.2/
       bin/neo4j stop
       #+END_SRC

*** Accessing Neo4j directly
    You can access the graph database directly by navigating to
    [[http://localhost:7474/browser/]] in your browser. This gives you a
    graphical interface for entering Cypher commands to interact with
    the database.

    Neo4j also comes with a command line interface ("Neo4j Shell") for
    interacting with databases. After stopping the database as
    described above you can issue the following command to start the
    shell:

    #+BEGIN_SRC sh
    bin/neo4j-shell -path data/graph.db/
    #+END_SRC

    More information about how to work with the Neo4j Shell can be
    found [[http://neo4j.com/docs/2.1.2/shell.html][here]].

* Project Structure
  #+BEGIN_EXAMPLE
  .
  ├── .git
  ├── deps
  ├── doxygen
  ├── ode
  ├── training-materials
  ├── initial-data.cql
  ├── README.org
  ├── README.pdf
  └── README.tex
  #+END_EXAMPLE

** =deps=
   #+BEGIN_EXAMPLE
   deps/
   └── neo4j-community-2.1.2-unix.tar.gz
   #+END_EXAMPLE

   This folder contains third-party software that ODE depends on.

