README.tex
% Created 2015-03-12 Thu 12:55
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel}
\usepackage[left=2.5cm,right=2.5cm,top=2.8cm,bottom=3cm]{geometry}
\setlength{\parindent}{0cm}
\setlength{\parskip}{0.1cm}
\usepackage{pmboxdraw}
\DeclareUnicodeCharacter{00A0}{~}
\DeclareUnicodeCharacter{251C}{\pmboxdrawuni{251C}}
\renewcommand{\arraystretch}{1.2}
\author{Tim Krones}
\date{\today}
\title{ODE README}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{About}
\label{sec-1}
ODE (Output DEsigner) is a system for rapid development of
large-scale rule bases for template-based natural language
generation for conversational agents.

It was developed in the context of \href{http://www.aliz-e.org/}{ALIZ-E}, a \href{http://www.dfki.de/lt/project.php?id=Project_576&l=en}{project} that was
carried out jointly by the German Research Center for Artificial
Intelligence (\href{http://www.dfki.de/}{DFKI}) and a number of European partners.

\section{Setting up}
\label{sec-2}
\subsection{Dependencies}
\label{sec-2-1}
ODE requires:

\begin{itemize}
\item \textbf{Java SDK 7} (Oracle JDK 7 or OpenJDK 7).
It has not been tested with Java 8, although newer versions of
play! (the MVC framework on which ODE is built) \href{https://github.com/playframework/playframework/issues/1220}{seem to be Java 8-ready}.
\item \textbf{play-2.2.1}
\item \textbf{neo4j-community-2.1.2} (bundled with this distribution of ODE).
\item \textbf{Twitter Bootstrap v3.0.2} (\href{https://en.wikipedia.org/wiki/Minification_(programming)}{minified} version bundled with this
distribution of ODE).
\item \textbf{jQuery v1.11.0} (minified version bundled with this distribution
of ODE).
\item \textbf{jQuery UI v1.10.4} (minified version bundled with this
distribution of ODE).
\item \textbf{Underscore.js v1.5.2} (minified version bundled with this
distribution of ODE).
\item \textbf{Backbone.js v1.1.0} (minified version bundled with this
distribution of ODE).
\end{itemize}

\begin{center}
\begin{tabular}{lrll}
\hline
\textbf{Dependency} & \textbf{Version} & \textbf{Bundled} & \textbf{Setup required}\\
\hline
Java SDK & 7 & no & yes\\
play! & 2.2.1 & no & yes\\
Neo4j & 2.1.2 & yes & yes\\
Twitter Bootstrap & 3.0.2 & yes (minified) & no\\
jQuery & 1.11.0 & yes (minified) & no\\
jQuery UI & 1.10.4 & yes (minified) & no\\
Underscore.js & 1.5.2 & yes (minified) & no\\
Backbone.js & 1.1.0 & yes (minified) & no\\
\hline
\end{tabular}
\end{center}

\subsection{Initial setup}
\label{sec-2-2}
Follow these steps to prepare your environment for working on ODE:

\begin{enumerate}
\item Install \textbf{Java SDK 7}.

\item If you haven't done so already, clone the ODE repository from
GitHub:

\begin{verbatim}
git clone https://github.com/itsjeyd/ODE
\end{verbatim}

\item Extract \url{deps/neo4j-community-2.1.2-unix.tar.gz}.

\item Load initial data:

\begin{verbatim}
cd /path/to/neo4j-community-2.1.2/
bin/neo4j-shell -path data/graph.db/ -file /path/to/this/repo/initial-data.cql
\end{verbatim}

The output of the second command should look like this:

\begin{verbatim}
+-----------------------------------------------------+
| n                                                   |
+-----------------------------------------------------+
| Node[0]{username:"dev@ode.com",password:"password"} |
+-----------------------------------------------------+
1 row
Nodes created: 1
Properties set: 2
Labels added: 1
1880 ms

+--------------------------------+
| n                              |
+--------------------------------+
| Node[1]{name:"underspecified"} |
+--------------------------------+
1 row
Nodes created: 1
Properties set: 1
Labels added: 1
36 ms
\end{verbatim}

\item Download play! (Version 2.2.1) from \href{http://downloads.typesafe.com/play/2.2.1/play-2.2.1.zip}{here} and extract it. Make
sure you choose a location to which you have both read and write
access.

\item Make sure that the \texttt{play} script is executable:

\begin{verbatim}
cd /path/to/play-2.2.1/
chmod a+x play
chmod a+x framework/build
\end{verbatim}

\item Add directory of \texttt{play} executable to your \texttt{PATH}:

\begin{verbatim}
export PATH=$PATH:/path/to/play-2.2.1/
\end{verbatim}

Add this code to your \texttt{.bashrc}, \texttt{.zshrc}, etc. to make the
modification permanent.
\end{enumerate}

\subsection{Daily workflow}
\label{sec-2-3}
\subsubsection{Before}
\label{sec-2-3-1}
\begin{enumerate}
\item Start Neo4j:

\begin{verbatim}
cd /path/to/neo4j-community-2.1.2/
bin/neo4j start-no-wait
\end{verbatim}

\item Start play!:

\begin{verbatim}
cd /path/to/this/repo/ode/
play
\end{verbatim}

\item Run application (from \texttt{play} console):

\begin{verbatim}
run
\end{verbatim}

\item Access application by navigating to \url{http://localhost:9000/} in
your browser.

When you do this for the first time you will also need to perform
the following steps:

\begin{enumerate}
\item Click the ``Login'' button in the top-right corner

\item Enter credentials:
\begin{itemize}
\item Email: \texttt{dev@ode.com}
\item Password: \texttt{password}
\end{itemize}
\end{enumerate}
As you make changes to the code, refreshing the current page in
the browser will cause \texttt{play} to recompile the project.
Note that compilation will only be triggered after changes to
(server-side) code that actually \emph{needs} to be compiled.
Modifying client-side code will not trigger compilation.
\end{enumerate}

\subsubsection{After}
\label{sec-2-3-2}
\begin{enumerate}
\item Stop application (from \texttt{play} console): \texttt{Ctrl-D}

\item Stop Neo4j:

\begin{verbatim}
cd /path/to/neo4j-community-2.1.2/
bin/neo4j stop
\end{verbatim}
\end{enumerate}

\subsubsection{Accessing Neo4j directly}
\label{sec-2-3-3}
You can access the graph database directly by navigating to
\url{http://localhost:7474/browser/} in your browser. This gives you a
graphical interface for entering Cypher commands to interact with
the database.

Neo4j also comes with a command line interface (``Neo4j Shell'') for
interacting with databases. After stopping the database as
described above you can issue the following command to start the
shell:

\begin{verbatim}
bin/neo4j-shell -path data/graph.db/
\end{verbatim}

More information about how to work with the Neo4j Shell can be
found \href{http://neo4j.com/docs/2.1.2/shell.html}{here}.

\section{Project Structure}
\label{sec-3}
\begin{verbatim}
.
├── .git
├── deps
├── doxygen
├── ode
├── training-materials
├── initial-data.cql
├── README.org
├── README.pdf
└── README.tex
\end{verbatim}

\subsection{\texttt{deps}}
\label{sec-3-1}
\begin{verbatim}
deps/
└── neo4j-community-2.1.2-unix.tar.gz
\end{verbatim}

This folder contains third-party software that ODE depends on.
