README.org
** =doxygen=
   #+BEGIN_EXAMPLE
   doxygen/
   ├── Doxyfile
   └── html.tar.gz
   #+END_EXAMPLE

   This folder contains documentation for server-side code in HTML
   format. After extracting [[file:doxygen/html.tar.gz][html.tar.gz]], the entry point for viewing
   the documentation is [[file:doxygen/html/index.html][html/index.html]]. A graphical representation of
   the class hierarchy is available under [[file:doxygen/html/inherits.html][html/inherits.html]].

   To regenerate the documentation after modifying the source code,
   run the following commands:

   #+BEGIN_SRC sh
   cd /path/to/this/repo/doxygen
   doxygen Doxyfile
   #+END_SRC

   Note that this will overwrite the contents of the =html= folder
   that contains the documentation extracted from =html.tar.gz=.

   On many Linux distributions, Doxygen can be installed from
   official package repositories. It can also be built from source on
   Unix and Windows as described [[http://www.stack.nl/~dimitri/doxygen/manual/install.html][here]]. The documentation bundled with
   this distribution of ODE was generated using Doxygen 1.8.9.

** =ode=
   #+BEGIN_EXAMPLE
   ode/
   ├── app
   ├── conf
   ├── logs
   ├── project
   ├── public
   ├── test
   ├── build.sbt
   └── README
   #+END_EXAMPLE

   This folder contains the complete source code of ODE. While
   extending ODE you will mostly be working with files located in the
   =app=, =public=, and =test= directories.

*** =app=
    #+BEGIN_EXAMPLE
    ode/app/
    ├── constants
    ├── controllers
    ├── managers
    ├── models
    ├── neo4play
    ├── utils
    ├── views
    └── Global.java
    #+END_EXAMPLE

**** =constants=:
     Enums that define *node and relationship types*.

**** =controllers=:
     :PROPERTIES:
     :CUSTOM_ID: struct-ode-app-controllers
     :END:
     Classes that implement *methods for handling user requests*. Each
     controller method is associated with a specific type of HTTP
     request (=GET=, =POST=, =PUT=, =DELETE=) and URL (cf. information
     on [[https://github.com/itsjeyd/ODE#conf][conf]] directory below).

**** =managers=:
     Classes that *handle communication with the [[https://github.com/itsjeyd/ODE#neo4play][database access layer]]*.

     Each [[https://github.com/itsjeyd/ODE#models][model class]] has a static =nodes= field or a static
     =relationships= field that stores a reference to an appropriate
     Manager object. Managers *implement appropriate CRUD (Create,
     Read, Update, Delete) methods* for obtaining and operating on
     model data. When handling user requests, [[https://github.com/itsjeyd/ODE#controllers][controllers]] call these
     methods via the =nodes= and =relationships= fields of relevant
     model classes.

**** =models=:
     :PROPERTIES:
     :CUSTOM_ID: struct-ode-app-models
     :END:
     *Classes representing domain entities* (such as rules, features,
     and values) *and relationships* between them.

**** =neo4play=:
     :PROPERTIES:
     :CUSTOM_ID: struct-ode-app-neo4play
     :END:
     Classes that implement a custom *database access layer* for
     communicating with Neo4j.

**** =utils=:
     *Utility classes* for manipulating strings and generating Version
     3 and Version 4 UUIDs. Any additional utility classes that you
     implement should be added to this folder.

**** =views=:
     *Server-side templates* for rendering different user interfaces.
     Controllers will inject relevant data into these templates when
     users request corresponding interfaces. Note that most rendering
     operations actually happen on the client; the templates in this
     folder only provide basic scaffolding for the different
     interfaces that are part of the current implementation.

**** =Global.java=:
     Defines *custom global settings* for ODE. Currently, the =Global=
     class defines how ODE should behave for different types of
     errors.

*** =conf=
    :PROPERTIES:
    :CUSTOM_ID: struct-ode-conf
    :END:
    #+BEGIN_EXAMPLE
    ode/conf/
    ├── application.conf
    └── routes
    #+END_EXAMPLE

    This folder contains configuration files for ODE.

    =application.conf= is the main configuration file; it contains
    standard configuration parameters. You should not have to touch
    this file very often during day-to-day development.

    =routes= defines mappings between pairs of the form =<HTTP-verb>
    <URL>= and [[https://github.com/itsjeyd/ODE#controllers][controller methods]]:

    #+BEGIN_EXAMPLE
    # Home page
    GET     /                           controllers.Application.home()

    # Authentication
    POST    /register                   controllers.Auth.register()
    GET     /login                      controllers.Application.login()
    POST    /login                      controllers.Auth.authenticate()
    GET     /logout                     controllers.Application.logout()

    # Browsing
    GET     /rules                      controllers.Rules.browse()
    GET     /rules/:name                controllers.Rules.details(name: String)

    ...
    #+END_EXAMPLE

    Every time you add a new controller method that renders an
    additional interface or serves as an endpoint for AJAX requests,
    you have to define a URL for it in this file.

*** =logs=
    #+BEGIN_EXAMPLE
    ode/logs/
    └── application.log
    #+END_EXAMPLE

    This folder contains log files produced by ODE. By default, all
    logging output is written to =application.log=.

*** =project=
    #+BEGIN_EXAMPLE
    ode/project/
    ├── build.properties
    └── plugins.sbt
    #+END_EXAMPLE

    play! applications are built using [[http://www.scala-sbt.org/][sbt]] (Scala Build Tool). This
    folder contains the =sbt= build definitions; =plugins.sbt= defines
    =sbt= plugins used by ODE, and =build.properties= contains the
    =sbt= version to use for building the application.

    You should not have to touch the files in this folder very often
    during day-to-day development.

