README.tex

\subsection{\texttt{doxygen}}
\label{sec-3-2}
\begin{verbatim}
doxygen/
├── Doxyfile
└── html.tar.gz
\end{verbatim}

This folder contains documentation for server-side code in HTML
format. After extracting \href{doxygen/html.tar.gz}{\texttt{html.tar.gz}}, the entry point for viewing
the documentation is \href{doxygen/html/index.html}{\texttt{html/index.html}}. A graphical representation
of the class hierarchy is available under \href{doxygen/html/inherits.html}{\texttt{html/inherits.html}}.

To regenerate the documentation after modifying the source code,
run the following commands:

\begin{verbatim}
cd /path/to/this/repo/doxygen
doxygen Doxyfile
\end{verbatim}

Note that this will overwrite the contents of the \texttt{html} folder
that contains the documentation extracted from \texttt{html.tar.gz}.

On many Linux distributions, Doxygen can be installed from
official package repositories. It can also be built from source on
Unix and Windows as described \href{http://www.stack.nl/~dimitri/doxygen/manual/install.html}{here}. The documentation bundled with
this distribution of ODE was generated using Doxygen 1.8.9.

\subsection{\texttt{ode}}
\label{sec-3-3}
\begin{verbatim}
ode/
├── app
├── conf
├── logs
├── project
├── public
├── test
├── build.sbt
└── README
\end{verbatim}

This folder contains the complete source code of ODE. While
extending ODE you will mostly be working with files located in the
\texttt{app}, \texttt{public}, and \texttt{test} directories.

\subsubsection{\texttt{app}}
\label{sec-3-3-1}
\begin{verbatim}
ode/app/
├── constants
├── controllers
├── managers
├── models
├── neo4play
├── utils
├── views
└── Global.java
\end{verbatim}

\paragraph{\texttt{constants}:}
\label{sec-3-3-1-1}
Enums that define \textbf{node and relationship types}.

\paragraph{\texttt{controllers}:}
\label{sec-3-3-1-2}
Classes that implement \textbf{methods for handling user requests}. Each
controller method is associated with a specific type of HTTP
request (\texttt{GET}, \texttt{POST}, \texttt{PUT}, \texttt{DELETE}) and URL (cf. Section
\ref{sec-3-3-2} below).

\paragraph{\texttt{managers}:}
\label{sec-3-3-1-3}
Classes that \textbf{handle communication with the \hyperref[sec-3-3-1-5]{database access
layer}}.

Each \hyperref[sec-3-3-1-4]{model class} has a static \texttt{nodes} field or a static
\texttt{relationships} field that stores a reference to an appropriate
Manager object. Managers \textbf{implement appropriate CRUD (Create,
Read, Update, Delete) methods} for obtaining and operating on
model data. When handling user requests, \hyperref[sec-3-3-1-2]{controllers} call these
methods via the \texttt{nodes} and \texttt{relationships} fields of relevant
model classes.

\paragraph{\texttt{models}:}
\label{sec-3-3-1-4}
\textbf{Classes representing domain entities} (such as rules, features,
and values) \textbf{and relationships} between them.

\paragraph{\texttt{neo4play}:}
\label{sec-3-3-1-5}
Classes that implement a custom \textbf{database access layer} for
communicating with Neo4j.

\paragraph{\texttt{utils}:}
\label{sec-3-3-1-6}
\textbf{Utility classes} for manipulating strings and generating Version
3 and Version 4 UUIDs. Any additional utility classes that you
implement should be added to this folder.

\paragraph{\texttt{views}:}
\label{sec-3-3-1-7}
\textbf{Server-side templates} for rendering different user interfaces.
Controllers will inject relevant data into these templates when
users request corresponding interfaces. Note that most rendering
operations actually happen on the client; the templates in this
folder only provide basic scaffolding for the different
interfaces that are part of the current implementation.

\paragraph{\texttt{Global.java}:}
\label{sec-3-3-1-8}
Defines \textbf{custom global settings} for ODE. Currently, the \texttt{Global}
class defines how ODE should behave for different types of
errors.

\subsubsection{\texttt{conf}}
\label{sec-3-3-2}
\begin{verbatim}
ode/conf/
├── application.conf
└── routes
\end{verbatim}

This folder contains configuration files for ODE.

\texttt{application.conf} is the main configuration file; it contains
standard configuration parameters. You should not have to touch
this file very often during day-to-day development.

\texttt{routes} defines mappings between pairs of the form \texttt{<HTTP-verb>
    <URL>} and \hyperref[sec-3-3-1-2]{controller methods}:

\begin{verbatim}
# Home page
GET     /                           controllers.Application.home()

# Authentication
POST    /register                   controllers.Auth.register()
GET     /login                      controllers.Application.login()
POST    /login                      controllers.Auth.authenticate()
GET     /logout                     controllers.Application.logout()

# Browsing
GET     /rules                      controllers.Rules.browse()
GET     /rules/:name                controllers.Rules.details(name: String)

...
\end{verbatim}

Every time you add a new controller method that renders an
additional interface or serves as an endpoint for AJAX requests,
you have to define a URL for it in this file.

\subsubsection{\texttt{logs}}
\label{sec-3-3-3}
\begin{verbatim}
ode/logs/
└── application.log
\end{verbatim}

This folder contains log files produced by ODE. By default, all
logging output is written to \texttt{application.log}.

\subsubsection{\texttt{project}}
\label{sec-3-3-4}
\begin{verbatim}
ode/project/
├── build.properties
└── plugins.sbt
\end{verbatim}

play! applications are built using \href{http://www.scala-sbt.org/}{\texttt{sbt}} (Scala Build Tool). This
folder contains the \texttt{sbt} build definitions; \texttt{plugins.sbt} defines
\texttt{sbt} plugins used by ODE, and \texttt{build.properties} contains the
\texttt{sbt} version to use for building the application.

You should not have to touch the files in this folder very often
during day-to-day development.
