README.org
*** =public=
    #+BEGIN_EXAMPLE
    ode/public/
    ├── css
    │   ├── lib
    │   │   └── bootstrap.min.css
    │   ├── browse.css
    │   ├── details.css
    │   ├── features.css
    │   ├── input.css
    │   ├── main.css
    │   ├── output.css
    │   └── search.css
    ├── fonts
    │   └── ...
    ├── images
    │   └── ...
    └── js
        ├── lib
        │   ├── backbone-min.js
        │   ├── bootstrap.min.js
        │   ├── jquery.min.js
        │   ├── jquery-ui.min.js
        │   └── underscore-min.js
        ├── browse.js
        ├── combinations.js
        ├── details.js
        ├── error.js
        ├── features.js
        ├── header.js
        ├── input.js
        ├── ode.js
        ├── output.js
        └── search.js
    #+END_EXAMPLE

    This folder contains code that implements client-side
    functionality of ODE. The following table shows associations
    between routes, controller methods, server-side templates, and
    corresponding client-side code (CSS and JavaScript):

    |---------------------------+---------------------+---------------------+--------------+-------------|
    | *Route*                   | *Controller*        | *Template*          | *CSS*        | *JS*        |
    |---------------------------+---------------------+---------------------+--------------+-------------|
    | =GET /=                   | =Application.home=  | home.scala.html     | -            | -           |
    | =GET /rules=              | =Rules.browse=      | browse.scala.html   | browse.css   | browse.js   |
    | =GET /rules/:name=        | =Rules.details=     | details.scala.html  | details.css  | details.js  |
    | =GET /features=           | =Features.features= | features.scala.html | features.css | features.js |
    | =GET /rules/:name/input=  | =Rules.input=       | input.scala.html    | input.css    | input.js    |
    | =GET /rules/:name/output= | =Rules.output=      | output.scala.html   | output.css   | output.js   |
    | =GET /search=             | =Search.search=     | search.scala.html   | search.css   | search.js   |
    |---------------------------+---------------------+---------------------+--------------+-------------|

    Each of the JS modules listed above makes use of a number of
    utility functions for

    - operating on strings
    - creating new DOM elements
    - operating on existing DOM elements.

    These functions are defined in the =ode.js= module.

*** =test=
    #+BEGIN_EXAMPLE
    ode/test/
    ├── controllers
    ├── managers
    ├── models
    ├── neo4play
    ├── utils
    ├── views
    └── IntegrationTest.java
    #+END_EXAMPLE

    This folder contains tests for server-side functionality of ODE.
    Its structure parallels the structure of the =app= folder: Tests
    for controllers are located in the =controllers= folder, tests for
    utilities are located in the =utils= folder, etc.

    To run the test suite:

    #+BEGIN_SRC sh
    cd /path/to/this/repo/ode/
    play test
    #+END_SRC

    You can also run the tests from the =play= console. The sequence
    of commands then becomes:

    #+BEGIN_SRC sh
    cd /path/to/this/repo/ode/
    play
    test
    #+END_SRC

*** =build.sbt=
    This file contains the main build declarations for ODE.

** =training-materials=
   #+BEGIN_EXAMPLE
   training-materials/
   ├── assignment
   │   ├── assignment.html
   │   ├── gold-standard
   │   │   ├── input.org
   │   │   └── output.org
   │   ├── reference.pdf
   │   └── reference.tex
   ├── css
   │   └── ...
   ├── js
   │   └── ...
   ├── questionaire
   │   ├── answers
   │   │   └── data.json
   │   ├── persist.php
   │   └── questionaire.html
   ├── sounds
   │   └── ...
   ├── training
   │   ├── 00-intro.html
   │   ├── 01-create_rule.html
   │   ├── 02-add_feature.html
   │   ├── 03-set_value.html
   │   ├── 04-remove_feature.html
   │   ├── 05-rename_rule.html
   │   ├── 06-change_description.html
   │   ├── 07-switching.html
   │   ├── 08-add_output_string.html
   │   ├── 09-modify_output_string.html
   │   ├── 10-remove_output_string.html
   │   ├── 11-split_output_string.html
   │   ├── 12-add_part.html
   │   ├── 13-show_output.html
   │   ├── 14-modify_part.html
   │   ├── 15-remove_part.html
   │   ├── 16-add_slot.html
   │   ├── 17-remove_slot.html
   │   ├── 18-parts_inventory.html
   │   ├── 19-multiple_groups.html
   │   └── 20-browse_rules.html
   ├── intermission.html
   └── overview.html
   #+END_EXAMPLE

   This folder contains materials that can be used to train novice
   users to use ODE (and to gather feedback about the system). The
   entry point for starting the training process is [[file:training-materials/overview.html][overview.html]].

   Feedback submitted via the questionnaire will be stored in
   [[file:training-materials/questionaire/answers/data.json][data.json]]. *Note* that in order for this to work,

   1. a web server (such as Apache) has to serve the file [[file:training-materials/questionaire/persist.php][persist.php]]
      at [[http://localhost/persist.php]]
   2. the user under which the web server is running must have write
      access to [[file:training-materials/questionaire/answers/data.json][data.json]].

   Additionally, as a preparatory step the string
   =/path/to/this/repo/= in line 8 of =persist.php= has to be
   replaced with the absolute path of this repository.

*** Data
    In order to use the training materials /as is/, you'll need to
    prepopulate a fresh database instance (i.e., an instance that only
    contains nodes listed in [[file:initial-data.cql][initial-data.sql]]) with the data shown
    below.

    If you need to add this data to many different Neo4j instances,
    you can create a =.cql= script (or simply extend [[file:initial-data.cql][initial-data.sql]])
    and load it as described in [[https://github.com/itsjeyd/ODE#initial-setup][initial setup]] above.

**** Features
     |-------------+--------------------------------------------------------------------+--------|
     | *name*      | *description*                                                      | *type* |
     |-------------+--------------------------------------------------------------------+--------|
     | About       | What is the current SpeechAct about?                               | atomic |
     | ChildGender | Stores the gender of the current user.                             | atomic |
     | ChildName   | Stores the name of the current user.                               | atomic |
     | CurrentGame | Stores the game that the agent and the user are currently playing. | atomic |
     | Encounter   | Is this the first encounter between the agent and the current user | atomic |
     |             | or have they met before?                                           |        |
     | Familiarity | Is the agent familiar with the current user?                       | atomic |
     | GameQuiz    | Is this the first time the agent and the current user              | atomic |
     |             | are playing the quiz game or have they played it before?           |        |
     | SpeechAct   | Type of utterance to perform (e.g. greeting, request)              | atomic |
     |-------------+--------------------------------------------------------------------+--------|

**** Values
     |----------------|
     | *name*         |
     |----------------|
     | Emilia         |
     | Marco          |
     | answer         |
     | answerRetry    |
     | apologize      |
     | closing        |
     | dance          |
     | female         |
     | first          |
     | fun            |
     | greeting       |
     | imitation      |
     | male           |
     | no             |
     | notfirst       |
     | play           |
     | quiz           |
     | request        |
     | underspecified |
     | unknown        |
     | yes            |
     |----------------|

     Note that if you use ODE to populate the DB manually, you do
     /not/ need to create the =underspecified= value yourself:
     [[file:initial-data.cql][initial-data.sql]] already contains an appropriate Cypher query for
     adding this node. Just make sure you load it as described in
     [[https://github.com/itsjeyd/ODE#initial-setup][initial setup]] above /before/ creating any features.

