README.tex

\subsubsection{\texttt{public}}
\label{sec-3-3-5}
\begin{verbatim}
ode/public/
├── css
│   ├── lib
│   │   └── bootstrap.min.css
│   ├── browse.css
│   ├── details.css
│   ├── features.css
│   ├── input.css
│   ├── main.css
│   ├── output.css
│   └── search.css
├── fonts
│   └── ...
├── images
│   └── ...
└── js
    ├── lib
    │   ├── backbone-min.js
    │   ├── bootstrap.min.js
    │   ├── jquery.min.js
    │   ├── jquery-ui.min.js
    │   └── underscore-min.js
    ├── browse.js
    ├── combinations.js
    ├── details.js
    ├── error.js
    ├── features.js
    ├── header.js
    ├── input.js
    ├── ode.js
    ├── output.js
    └── search.js
\end{verbatim}

This folder contains code that implements client-side
functionality of ODE. The following table shows associations
between routes, controller methods, server-side templates, and
corresponding client-side code (CSS and JavaScript):

\begin{center}
\begin{tabular}{lllll}
\hline
\textbf{Route} & \textbf{Controller} & \textbf{Template} & \textbf{CSS} & \textbf{JS}\\
\hline
\texttt{GET /} & \texttt{Application.home} & home.scala.html & - & -\\
\texttt{GET /rules} & \texttt{Rules.browse} & browse.scala.html & browse.css & browse.js\\
\texttt{GET /rules/:name} & \texttt{Rules.details} & details.scala.html & details.css & details.js\\
\texttt{GET /features} & \texttt{Features.features} & features.scala.html & features.css & features.js\\
\texttt{GET /rules/:name/input} & \texttt{Rules.input} & input.scala.html & input.css & input.js\\
\texttt{GET /rules/:name/output} & \texttt{Rules.output} & output.scala.html & output.css & output.js\\
\texttt{GET /search} & \texttt{Search.search} & search.scala.html & search.css & search.js\\
\hline
\end{tabular}
\end{center}

Each of the JS modules listed above makes use of a number of
utility functions for

\begin{itemize}
\item operating on strings
\item creating new DOM elements
\item operating on existing DOM elements.
\end{itemize}

These functions are defined in the \texttt{ode.js} module.

\subsubsection{\texttt{test}}
\label{sec-3-3-6}
\begin{verbatim}
ode/test/
├── controllers
├── managers
├── models
├── neo4play
├── utils
├── views
└── IntegrationTest.java
\end{verbatim}

This folder contains tests for server-side functionality of ODE.
Its structure parallels the structure of the \texttt{app} folder: Tests
for controllers are located in the \texttt{controllers} folder, tests for
utilities are located in the \texttt{utils} folder, etc.

To run the test suite:

\begin{verbatim}
cd /path/to/this/repo/ode/
play test
\end{verbatim}

You can also run the tests from the \texttt{play} console. The sequence
of commands then becomes:

\begin{verbatim}
cd /path/to/this/repo/ode/
play
test
\end{verbatim}

\subsubsection{\texttt{build.sbt}}
\label{sec-3-3-7}
This file contains the main build declarations for ODE.

\subsection{\texttt{training-materials}}
\label{sec-3-4}
\begin{verbatim}
training-materials/
├── assignment
│   ├── assignment.html
│   ├── gold-standard
│   │   ├── input.org
│   │   └── output.org
│   ├── reference.pdf
│   └── reference.tex
├── css
│   └── ...
├── js
│   └── ...
├── questionaire
│   ├── answers
│   │   └── data.json
│   ├── persist.php
│   └── questionaire.html
├── sounds
│   └── ...
├── training
│   ├── 00-intro.html
│   ├── 01-create_rule.html
│   ├── 02-add_feature.html
│   ├── 03-set_value.html
│   ├── 04-remove_feature.html
│   ├── 05-rename_rule.html
│   ├── 06-change_description.html
│   ├── 07-switching.html
│   ├── 08-add_output_string.html
│   ├── 09-modify_output_string.html
│   ├── 10-remove_output_string.html
│   ├── 11-split_output_string.html
│   ├── 12-add_part.html
│   ├── 13-show_output.html
│   ├── 14-modify_part.html
│   ├── 15-remove_part.html
│   ├── 16-add_slot.html
│   ├── 17-remove_slot.html
│   ├── 18-parts_inventory.html
│   ├── 19-multiple_groups.html
│   └── 20-browse_rules.html
├── intermission.html
└── overview.html
\end{verbatim}

This folder contains materials that can be used to train novice
users to use ODE (and to gather feedback about the system). The
entry point for starting the training process is \href{training-materials/overview.html}{\texttt{overview.html}}.

Feedback submitted via the questionnaire will be stored in
\href{training-materials/questionaire/answers/data.json}{\texttt{data.json}}. \textbf{Note} that in order for this to work,

\begin{enumerate}
\item a web server (such as Apache) has to serve the file
\href{training-materials/questionaire/persist.php}{\texttt{persist.php}} at \url{http://localhost/persist.php}
\item the user under which the web server is running must have write
access to \href{training-materials/questionaire/answers/data.json}{\texttt{data.json}}.
\end{enumerate}

Additionally, as a preparatory step the string
\texttt{/path/to/this/repo/} in line 8 of \texttt{persist.php} has to be
replaced with the absolute path of this repository.

\subsubsection{Data}
\label{sec-3-4-1}
In order to use the training materials \emph{as is}, you'll need to
prepopulate a fresh database instance (i.e., an instance that only
contains nodes listed in \href{initial-data.cql}{\texttt{initial-data.sql}}) with the data shown
below.

If you need to add this data to many different Neo4j instances, you
can create a \texttt{.cql} script (or simply extend \href{initial-data.cql}{\texttt{initial-data.sql}})
and load it as described in Section \ref{sec-2-2} above.

\paragraph{Features}
\label{sec-3-4-1-1}
\begin{center}
\begin{tabular}{lll}
\hline
\texttt{name} & \texttt{description} & \texttt{type}\\
\hline
About & What is the current SpeechAct about? & atomic\\
ChildGender & Stores the gender of the current user. & atomic\\
ChildName & Stores the name of the current user. & atomic\\
CurrentGame & Stores the game that the agent and the user are currently playing. & atomic\\
Encounter & Is this the first encounter between the agent and the current user & atomic\\
 & or have they met before? & \\
Familiarity & Is the agent familiar with the current user? & atomic\\
GameQuiz & Is this the first time the agent and the current user & atomic\\
 & are playing the quiz game or have they played it before? & \\
SpeechAct & Type of utterance to perform (e.g. greeting, request) & atomic\\
\hline
\end{tabular}
\end{center}

\paragraph{Values}
\label{sec-3-4-1-2}
\begin{center}
\begin{tabular}{l}
\hline
\texttt{name}\\
\hline
Emilia\\
Marco\\
answer\\
answerRetry\\
apologize\\
closing\\
dance\\
female\\
first\\
fun\\
greeting\\
imitation\\
male\\
no\\
notfirst\\
play\\
quiz\\
request\\
underspecified\\
unknown\\
yes\\
\hline
\end{tabular}
\end{center}

Note that if you use ODE to populate the DB manually, you do
\emph{not} need to create the \texttt{underspecified} value yourself:
\href{initial-data.cql}{\texttt{initial-data.sql}} already contains an appropriate Cypher query
for adding this node. Just make sure you load it as described in
Section \ref{sec-2-2} above \emph{before} creating any features.
