README.org
**** Associations between features and values
     |-------------+-------------------------------------------------------|
     | *Feature*   | *Permitted values*                                    |
     |-------------+-------------------------------------------------------|
     | About       | underspecified, fun, play, answerRetry, answer        |
     | ChildGender | underspecified, unknown, female, male                 |
     | ChildName   | underspecified, unknown, Marco, Emilia                |
     | CurrentGame | underspecified, quiz, imitation, dance                |
     | Encounter   | underspecified, notfirst, first                       |
     | Familiarity | underspecified, no, yes                               |
     | GameQuiz    | underspecified, notfirst, first                       |
     | SpeechAct   | underspecified, closing, apologize, request, greeting |
     |-------------+-------------------------------------------------------|

     Note that if you use ODE to populate the DB manually, you do
     /not/ need to add the =underspecified= value to the list of
     permitted values for each feature yourself: For each atomic
     feature you create, ODE automatically sets up a relationship
     between the feature in question and the =underspecified= value.

**** Rules
     |-----------------+-----------------------------------------+-------+-------|
     | *name*          | *description*                           | *LHS* | *RHS* |
     |-----------------+-----------------------------------------+-------+-------|
     | @firstEncounter | Agent meets someone for the first time. | (1)   | (2)   |
     |-----------------+-----------------------------------------+-------+-------|

***** (1) LHS
      |-------------+----------|
      | *Feature*   | *Value*  |
      |-------------+----------|
      | SpeechAct   | greeting |
      | Encounter   | first    |
      | Familiarity | no       |
      |-------------+----------|

***** (2) RHS
      - Group 1:

        |----------+--------------+-----------------|
        | *Slot 1* | *Slot 2*     | *Slot 3*        |
        |----------+--------------+-----------------|
        | Hi,      | how are you? | I am Nao.       |
        | Hey,     |              | My name is Nao. |
        | Hello,   |              |                 |
        |----------+--------------+-----------------|

      - Group 2:

        |------------+-------------------|
        | *Slot 1*   | *Slot 2*          |
        |------------+-------------------|
        | Hola!      | What's up?        |
        | Hey there! | Nice to meet you. |
        |------------+-------------------|

* Resources
** play!
   - Documentation for =play-2.2.x=:
     [[https://playframework.com/documentation/2.2.x/Home]]
   - Deployment:
     [[https://playframework.com/documentation/2.2.x/Production]]
   - Java API for =play-2.2.x=:
     [[https://playframework.com/documentation/2.2.x/api/java/index.html]]

** Neo4j
   - Manual for Neo4j v2.1.2:
     [[http://neo4j.com/docs/2.1.2/]]
   - Cypher Query Language:
     [[http://neo4j.com/docs/2.1.2/cypher-query-lang.html]]

** JS + CSS Frameworks
   - Twitter Bootstrap: [[http://getbootstrap.com/]]
     + CSS: [[http://getbootstrap.com/css/]]
     + UI components: [[http://getbootstrap.com/components/]]
     + JavaScript: [[http://getbootstrap.com/javascript/]]
   - jQuery: [[https://api.jquery.com/]]
   - jQuery UI: [[http://api.jqueryui.com/]]
   - Backbone.js: [[http://backbonejs.org/]]
   - Underscore.js: [[http://underscorejs.org/]]

** ODE
   In addition to this README, you can consult the following resources
   for in-depth information about ODE:

   - [[http://www.dfki.de/lt/publication_show.php?id=7689]["A System for Rapid Development of Large-Scale Rule Bases for Template-Based NLG for Conversational Agents"]] (Krones 2014) ([[http://www.dfki.de/lt/bibtex.php?id=7689][BibTeX]], [[http://www.dfki.de/web/forschung/iwi/publikationen/renameFileForDownload?filename=thesis-krones-final.pdf&file_id=uploads_2404][PDF]])
     + Part III (chapters 6-7): System Architecture + Technologies
     + Part IV (chapters 9-10), Appendix A: Data Models
     + Part V (chapters 11-15): User-Facing Functionality
     + Part VII (chapter 21): Future Work
     + Appendix B: Algorithms
   - Documentation generated with Doxygen
     + Searchable lists of packages, classes, files
     + Alphabetical index of classes
     + Textual and graphical class hierarchy
     + Alphabetical index of class members (with links to classes to
       which they belong)
     + Collaboration diagrams for individual classes
     + Call and caller graphs for member functions
     + Ability to jump to definitions of class members
   - =git= commit messages associated with this repository

** Other
   - Doxygen manual:
     [[http://www.stack.nl/~dimitri/doxygen/manual/index.html]]
   - Git:
     + [[http://git-scm.com/book][Pro Git]]
     + [[http://gitref.org/][Git Reference]]
     + [[http://jonas.nitro.dk/git/quick-reference.html][Git Quick Reference]]
     + [[http://www.ndpsoftware.com/git-cheatsheet.html][Git Cheatsheet]]
     + [[https://www.codeschool.com/courses/try-git][tryGit]]

* Contact Information
  Original author: Tim Krones (t.krones@gmx.net)
