README.tex

\paragraph{Associations between features and values}
\label{sec-3-4-1-3}
\begin{center}
\begin{tabular}{ll}
\hline
\textbf{Feature} & \textbf{Permitted values}\\
\hline
About & underspecified, fun, play, answerRetry, answer\\
ChildGender & underspecified, unknown, female, male\\
ChildName & underspecified, unknown, Marco, Emilia\\
CurrentGame & underspecified, quiz, imitation, dance\\
Encounter & underspecified, notfirst, first\\
Familiarity & underspecified, no, yes\\
GameQuiz & underspecified, notfirst, first\\
SpeechAct & underspecified, closing, apologize, request, greeting\\
\hline
\end{tabular}
\end{center}

Note that if you use ODE to populate the DB manually, you do
\emph{not} need to add the \texttt{underspecified} value to the list of
permitted values for each feature yourself: For each atomic
feature you create, ODE automatically sets up a relationship
between the feature in question and the \texttt{underspecified} value.

\paragraph{Rules}
\label{sec-3-4-1-4}
\begin{center}
\begin{tabular}{llll}
\hline
\texttt{name} & \texttt{description} & \textbf{LHS} & \textbf{RHS}\\
\hline
@firstEncounter & Agent meets someone for the first time. & (1) & (2)\\
\hline
\end{tabular}
\end{center}

\subparagraph{(1) LHS}
\label{sec-3-4-1-4-1}
\begin{center}
\begin{tabular}{ll}
\hline
\textbf{Feature} & \textbf{Value}\\
\hline
SpeechAct & greeting\\
Encounter & first\\
Familiarity & no\\
\hline
\end{tabular}
\end{center}

\subparagraph{(2) RHS}
\label{sec-3-4-1-4-2}
\begin{itemize}
\item Group 1:

\begin{center}
\begin{tabular}{lll}
\hline
\textbf{Slot 1} & \textbf{Slot 2} & \textbf{Slot 3}\\
\hline
Hi, & how are you? & I am Nao.\\
Hey, &  & My name is Nao.\\
Hello, &  & \\
\hline
\end{tabular}
\end{center}

\item Group 2:

\begin{center}
\begin{tabular}{ll}
\hline
\textbf{Slot 1} & \textbf{Slot 2}\\
\hline
Hola! & What's up?\\
Hey there! & Nice to meet you.\\
\hline
\end{tabular}
\end{center}
\end{itemize}

\section{Resources}
\label{sec-4}
\subsection{play!}
\label{sec-4-1}
\begin{itemize}
\item Documentation for \texttt{play-2.2.x}:
\url{https://playframework.com/documentation/2.2.x/Home}
\item Deployment:
\url{https://playframework.com/documentation/2.2.x/Production}
\item Java API for \texttt{play-2.2.x}:
\url{https://playframework.com/documentation/2.2.x/api/java/index.html}
\end{itemize}

\subsection{Neo4j}
\label{sec-4-2}
\begin{itemize}
\item Manual for Neo4j v2.1.2:
\url{http://neo4j.com/docs/2.1.2/}
\item Cypher Query Language:
\url{http://neo4j.com/docs/2.1.2/cypher-query-lang.html}
\end{itemize}

\subsection{JS + CSS Frameworks}
\label{sec-4-3}
\begin{itemize}
\item Twitter Bootstrap: \url{http://getbootstrap.com/}
\begin{itemize}
\item CSS: \url{http://getbootstrap.com/css/}
\item UI components: \url{http://getbootstrap.com/components/}
\item JavaScript: \url{http://getbootstrap.com/javascript/}
\end{itemize}
\item jQuery: \url{https://api.jquery.com/}
\item jQuery UI: \url{http://api.jqueryui.com/}
\item Backbone.js: \url{http://backbonejs.org/}
\item Underscore.js: \url{http://underscorejs.org/}
\end{itemize}

\subsection{ODE}
\label{sec-4-4}
In addition to this README, you can consult the following resources
for in-depth information about ODE:

\begin{itemize}
\item \href{thesis-krones.pdf}{``A System for Rapid Development of Large-Scale Rule Bases for Template-Based NLG for Conversational Agents''} (Krones 2014)
\begin{itemize}
\item Part III (chapters 6-7): System Architecture + Technologies
\item Part IV (chapters 9-10), Appendix A: Data Models
\item Part V (chapters 11-15): User-Facing Functionality
\item Part VII (chapter 21): Future Work
\item Appendix B: Algorithms
\end{itemize}
\item Documentation generated with Doxygen
\begin{itemize}
\item Searchable lists of packages, classes, files
\item Alphabetical index of classes
\item Textual and graphical class hierarchy
\item Alphabetical index of class members (with links to classes to
which they belong)
\item Collaboration diagrams for individual classes
\item Call and caller graphs for member functions
\item Ability to jump to definitions of class members
\end{itemize}
\item \texttt{git} commit messages associated with this repository
\end{itemize}

\subsection{Other}
\label{sec-4-5}
\begin{itemize}
\item Doxygen manual:
\url{http://www.stack.nl/~dimitri/doxygen/manual/index.html}
\item Git:
\begin{itemize}
\item \href{http://git-scm.com/book}{Pro Git}
\item \href{http://gitref.org/}{Git Reference}
\item \href{http://jonas.nitro.dk/git/quick-reference.html}{Git Quick Reference}
\item \href{http://www.ndpsoftware.com/git-cheatsheet.html}{Git Cheatsheet}
\item \href{https://www.codeschool.com/courses/try-git}{tryGit}
\end{itemize}
\end{itemize}

\section{Contact Information}
\label{sec-5}
Original author: Tim Krones (t.krones@gmx.net)
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
